### Dealing with Missing Values

In [2]:
import pandas as pd

In [4]:
employee_data=pd.read_csv("employee_data.csv")

In [9]:
#Step1:Remove duplicate entries
employee_data.drop_duplicates(inplace = True) # inplace - Impact the original data on to its variables

In [10]:
employee_data

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022

In [13]:
#Step2:Find out Null Enteries
employee_data.isnull().sum()

Name          1
Age           1
Department    0
Salary        1
Join_Date     0
dtype: int64

In [16]:
#Removing Missing Values
employee_data.dropna(inplace=True)

In [18]:
employee_data.shape

(4, 5)

#### Record in the Document
- In 7 data I have used to delete the 3 observations

In [19]:
employee_data.isnull().sum()

Name          0
Age           0
Department    0
Salary        0
Join_Date     0
dtype: int64